Data/Final_Implemented_data/FileSize/least_file_test/test_round.txt
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100kb.txt
Document Length:        102400 bytes

Concurrency Level:      10
Time taken for tests:   0.598 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      10259000 bytes
HTML transferred:       10240000 bytes
Requests per second:    167.33 [#/sec] (mean)
Time per request:       59.761 [ms] (mean)
Time per request:       5.976 [ms] (mean, across all concurrent requests)
Transfer rate:          16764.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       13   35  13.3     34      64
Processing:     0   12  21.9      7     209
Waiting:        0   10   9.0      7      38
Total:         14   47  25.2     43     235

Percentage of the requests served within a certain time (ms)
  50%     43
  66%     51
  75%     56
  80%     64
  90%     69
  95%     78
  98%     94
  99%    235
 100%    235 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_500kb.txt
Document Length:        512000 bytes

Concurrency Level:      10
Time taken for tests:   0.815 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      51219000 bytes
HTML transferred:       51200000 bytes
Requests per second:    122.69 [#/sec] (mean)
Time per request:       81.508 [ms] (mean)
Time per request:       8.151 [ms] (mean, across all concurrent requests)
Transfer rate:          61366.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   22   9.8     24      47
Processing:     1   32  65.7      7     233
Waiting:        0   26  59.4      5     230
Total:          8   54  66.1     34     267

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     41
  75%     45
  80%     47
  90%    206
  95%    233
  98%    259
  99%    267
 100%    267 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 10.1.0.0 (be patient).....done


Server Software:        SimpleHTTP/0.6
Server Hostname:        10.1.0.0
Server Port:            80

Document Path:          /test_100mb.txt
Document Length:        104857600 bytes

Concurrency Level:      10
Time taken for tests:   6.857 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      10485779300 bytes
HTML transferred:       10485760000 bytes
Requests per second:    14.58 [#/sec] (mean)
Time per request:       685.718 [ms] (mean)
Time per request:       68.572 [ms] (mean, across all concurrent requests)
Transfer rate:          1493327.34 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   28  17.4     21      69
Processing:   137  628 218.6    603    1102
Waiting:        2  413 207.3    383     859
Total:        156  656 215.7    630    1116

Percentage of the requests served within a certain time (ms)
  50%    630
  66%    716
  75%    857
  80%    887
  90%    973
  95%   1001
  98%   1075
  99%   1116
 100%   1116 (longest request)